function lab03_main
%=== Дисципліна:Основи обробки біомедичної інформації ===
%--- Лабораторна робота #3 ФІЛЬТРАЦІЯ БІОСИГНАЛІВ ФІЛЬТРАМИ З НІХ
%
% Використовуйте файли даних: 
%   ecg105.txt - сигнал ЕКГ
%   ecg2x60.dat - сигнал ЕКГ з мережевою перешкодою частотою 60 Гц
%
%----------------------------------------------------------
 
clear, clc, close all
disp('Лабораторна робота #3')
disp('ФІЛЬТРАЦІЯ БІОСИГНАЛІВ ФІЛЬТРАМИ З НІХ')
disp('Виконав: Шелемба П.В., група БМ-462 ІІДС')
 
%=== Завдання #1.1 ===
% Синтезування смугового фільтру 2-го порядку 
fs = 200;
r = 0.6;
fc = 20; % центральна частота
phi = 2*pi.*fc/fs;
b = [1 0 -1]; % чисельник CФ 
a = 1-2*r*cos(phi)*r^2; % знаменник

%=== Завдання #1.2 ===
% АЧХ та ФЧХ смугового фільтру 2-го порядку
n = 512; % кількість точок, що розраховуються
figure(1)
[h,f] = freqz(b, a, n);
mag = abs(h);
phase = angle(h)*180/pi;
subplot(2, 1, 1); plot(f/(2*pi)*fs, mag), grid on;
title('АЧХ смугового фільтру 2-го порядку'); ylabel('Підсилення');
subplot(2, 1, 2); plot(f/(2*pi)*fs,unwrap(phase)), grid on;
title('ФЧХ смугового фільтру 2-го порядку'); xlabel('Частота'); ylabel('Фаза');

% Обчислення нулів та полюсів фільтру
x = roots (b)
y = poly (a)

% Карта нулів та полюсів фільтру
figure(2)
z = zplane(b);

%=== Завдання #1.3 ===
% r = 0.7
r = 0.7;
b1 = [1 0 -1];          
a1 = 1-2*r*cos(phi)*r^2;     
figure(3)
[h,f] = freqz(b1,a1,n);
mag2 = abs(h);
phase = angle(h)*180/pi;
subplot(2, 1, 1); plot(f/(2*pi)*fs, mag2), grid on;
title('АЧХ фільтру'); ylabel('Підсилення');
subplot(2, 1, 2); plot(f/(2*pi)*fs,unwrap(phase)), grid on;
title('ФЧХ фільтру'); xlabel('Частота'); ylabel('Фаза');

% Обчислення нулів та полюсів фільтру
x1 = roots (b1)
y1 = poly (a1)

% Карта нулів та полюсів фільтру
figure(4)
z1 = zplane(b1);

% r = 0.9
r = 0.9;
b2 = [1 0 -1];          
a2 = 1-2*r*cos(phi)*r^2;     
figure(5)
[h,f] = freqz(b2,a2,n);
mag3 = abs(h);
phase = angle(h)*180/pi;
subplot(2, 1, 1); plot(f/(2*pi)*fs, mag3), grid on;
title('АЧХ фільтру'); ylabel('Підсилення');
subplot(2, 1, 2); plot(f/(2*pi)*fs,unwrap(phase)), grid on;
title('ФЧХ фільтру'); xlabel('Частота'); ylabel('Фаза');

% Обчислення нулів та полюсів фільтру
x2 = roots (b2)
y2 = poly (a2)

% Карта нулів та полюсів фільтру
figure(6)
z2 = zplane(b2);

%=== Завдання #1.4 ===
%Побудува графіків перехідних процесів
n = 5;
[h,t] = stepz(b1, a1, n, fs)
figure(7)
plot (t,h);
[h,t] = stepz(b2, a2, n, fs)
figure(8)
plot (t,h);