function lab03_main
%=== Дисципліна:Основи обробки біомедичної інформації ===
%--- Лабораторна робота #3 ФІЛЬТРАЦІЯ БІОСИГНАЛІВ ФІЛЬТРАМИ З НІХ
%
% Використовуйте файли даних: 
%   ecg105.txt - сигнал ЕКГ
%   ecg2x60.dat - сигнал ЕКГ з мережевою перешкодою частотою 60 Гц
%
%----------------------------------------------------------

clear, clc, close all
disp('Лабораторна робота #3')
disp('ФІЛЬТРАЦІЯ БІОСИГНАЛІВ ФІЛЬТРАМИ З НІХ')
disp('Виконав: , група ... ІІДС')

%=== Завдання #1.1 ===
% Синтезування смугового фільтру 2-го порядку 
fs =  
fc =                             % центральна частота
phi = 
b =                      % чисельник CФ 
a =  	% знаменник

%=== Завдання #1.2 ===
% АЧХ та ФЧХ смугового фільтру 2-го порядку
n =   % кількість точок, що розраховуються
figure()
[...] = freqz(...);
...
... введіть позначення осей графіків
...

% Обчислення нулів та полюсів фільтру
...

% Карта нулів та полюсів фільтру
...

%=== Завдання #1.3 ===
% r = 0.7
r = 
b1 =                 % чисельник CФ 
a1 =  	% знаменник
figure()
[...] = freqz(...);
...
... введіть позначення осей графіків
...

% Обчислення нулів та полюсів фільтру
...

% Карта нулів та полюсів фільтру
...

% r = 0.9
r = 
b2 =               % чисельник CФ 
a2 =  	% знаменник
figure()
[...] = freqz(...);
...
... введіть позначення осей графіків
...

% Обчислення нулів та полюсів фільтру
...

% Карта нулів та полюсів фільтру
...

%=== Завдання #1.4 ===
% Визначення добротності заданих фільтрів 

%=== Завдання #1.5 ===
%Побудува графіків перехідних процесів
n = 
...

%=== Завдання #2.1 ===
% Фільтрація ЕКГ при r = 0.6
fs = 
ecg = % сигнал ЕКГ
ecg = 
ecgf = filter(...)
t = 

%=== Завдання #2.2 ===
% Фільтрація ЕКГ при r = 0.7 та r = 0.8
% r = 0.7
...

% r = 0.8
...

% Графіки результатів фільтрації
...

%=== Завдання #3.1 ===
% Дослідження властивостей режекторного НІХ-фільтру
fs = 
r =  
phi1 = 
phi2 = 
a1 =  
a2 = 
a = 
b = 
H =  % передавальна функція

%=== Завдання #3.2 ===
% АЧХ та ФЧХ смугового режекторного НІХ-фільтру
n = 512;  % кількість точок, що розраховуються
figure()
...
... введіть позначення осей графіків
...

% Обчислення нулів та полюсів фільтру
...

% Карта нулів та полюсів фільтру
...

%=== Завдання #3.3 ===
% Порівняння АЧХ і ФЧХ режекторних НІХ і СІХ-фильтрів

%=== Завдання #3.4 ===
% Фільтрацію сигналу ЕКГ(файл ecg2x60.dat) режекторним фільтром
...

%=== Завдання #4.1 ===
% АЧХ і ФЧХ цифрових інтеграторів
% Інтегрування методом прямокутників 
fs =            % частота дискретизації
T = 
b =            % чисельник ПФ
a =          % знаменник ПФ
% Інтегрування методом трапецій.
b1 = 
a1 = 
% Інтегрування методом парабол (Сімпсона)
b2 = 
a2 = 

n  =   % кількість точок, що розраховуються
[...] = freqz(...);
...

... введіть позначення осей графіків
...

%=== Завдання #4.2 ===
% Обчислення нулів та полюсів інтеграторів
...

% Карта нулів та полюсів фільтру
...

% Карта нулів та полюсів фільтру
...

% Карта нулів та полюсів фільтру
...

%=== Завдання #4.3 ===
% Обчислення абсолютної похибки АЧХ
mag0 =   		% АЧХ ідеального інтегратора 
err = 
	
err1 = 
...

%=== Завдання #4.4 ===
% Інтегрування сигналу ЕКГ (файл ecg105.txt) інтеграторами 
fs = 
ecg =  % сигнал ЕКГ
ecg = 

% інтегратор за методом прямокутників
...

% інтегратор за методом трапецій
...

% інтегратор за методом парабол (Сімпсона)
...

% Графіки результатів інтегрування
...